JustAnother1/nomagic_probe/doc/RaspberryPi/rp2040-gh-1076.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SYSINFO</name>
      <version>1</version>
      <baseAddress>0x40000000</baseAddress>
      <size>32</size>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CHIP_ID</name>
          <description>JEDEC JEP-106 compliant chip identifier.</description>
          <addressOffset>0x0000</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REVISION</name>
              <bitRange>[31:28]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PART</name>
              <bitRange>[27:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MANUFACTURER</name>
              <bitRange>[11:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PLATFORM</name>
          <description>Platform register. Allows software to know what environment it is running in.</description>
          <addressOffset>0x0004</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ASIC</name>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FPGA</name>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GITREF_RP2040</name>
          <description>Git hash of the chip source. Used to identify chip version.</description>
          <addressOffset>0x0040</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>SYSCFG</name>
      <version>1</version>
      <description>Register block for various chip control signals</description>
      <baseAddress>0x40004000</baseAddress>
      <size>32</size>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>PROC0_NMI_MASK</name>
          <description>Processor core 0 NMI source mask\n
            Set a bit high to enable NMI from that IRQ</description>
          <addressOffset>0x0000</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <name>PROC1_NMI_MASK</name>
          <description>Processor core 1 NMI source mask\n
            Set a bit high to enable NMI from that IRQ</description>
          <addressOffset>0x0004</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
        </register>
        <register>
          <name>PROC_CONFIG</name>
          <description>Configuration for processors</description>
          <addressOffset>0x0008</addressOffset>
          <resetValue>0x10000000</resetValue>
          <fields>
            <field>
              <name>PROC1_DAP_INSTID</name>
              <description>Configure proc1 DAP instance ID.\n
                Recommend that this is NOT changed until you require debug access in multi-chip environment\n
                WARNING: do not set to 15 as this is reserved for RescueDP</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PROC0_DAP_INSTID</name>
              <description>Configure proc0 DAP instance ID.\n
                Recommend that this is NOT changed until you require debug access in multi-chip environment\n
                WARNING: do not set to 15 as this is reserved for RescueDP</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PROC1_HALTED</name>
              <description>Indication that proc1 has halted</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PROC0_HALTED</name>
              <description>Indication that proc0 has halted</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PROC_IN_SYNC_BYPASS</name>
          <description>For each bit, if 1, bypass the input synchronizer between that GPIO\n
            and the GPIO input register in the SIO. The input synchronizers should\n
            generally be unbypassed, to avoid injecting metastabilities into processors.\n
            If you're feeling brave, you can bypass to save two cycles of input\n
            latency. This register applies to GPIO 0...29.</description>
          <addressOffset>0x000c</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PROC_IN_SYNC_BYPASS</name>
              <bitRange>[29:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PROC_IN_SYNC_BYPASS_HI</name>
          <description>For each bit, if 1, bypass the input synchronizer between that GPIO\n
            and the GPIO input register in the SIO. The input synchronizers should\n
            generally be unbypassed, to avoid injecting metastabilities into processors.\n
            If you're feeling brave, you can bypass to save two cycles of input\n
            latency. This register applies to GPIO 30...35 (the QSPI IOs).</description>
          <addressOffset>0x0010</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PROC_IN_SYNC_BYPASS_HI</name>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DBGFORCE</name>
          <description>Directly control the SWD debug port of either processor</description>
          <addressOffset>0x0014</addressOffset>
          <resetValue>0x00000066</resetValue>
          <fields>
            <field>
              <name>PROC1_ATTACH</name>
              <description>Attach processor 1 debug port to syscfg controls, and disconnect it from external SWD pads.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PROC1_SWCLK</name>
              <description>Directly drive processor 1 SWCLK, if PROC1_ATTACH is set</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PROC1_SWDI</name>
              <description>Directly drive processor 1 SWDIO input, if PROC1_ATTACH is set</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PROC1_SWDO</name>
              <description>Observe the value of processor 1 SWDIO output.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PROC0_ATTACH</name>
              <description>Attach processor 0 debug port to syscfg controls, and disconnect it from external SWD pads.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PROC0_SWCLK</name>
              <description>Directly drive processor 0 SWCLK, if PROC0_ATTACH is set</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PROC0_SWDI</name>
              <description>Directly drive processor 0 SWDIO input, if PROC0_ATTACH is set</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PROC0_SWDO</name>
              <description>Observe the value of processor 0 SWDIO output.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MEMPOWERDOWN</name>
          <description>Control power downs to memories. Set high to power down memories.\n
            Use with extreme caution</description>
          <addressOffset>0x0018</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ROM</name>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>USB</name>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAM5</name>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAM4</name>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAM3</name>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAM2</name>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAM1</name>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SRAM0</name>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
