JustAnother1/nomagic_probe/doc/RaspberryPi/rp2040-gh-1076.svd
        <register>
          <name>PERFSEL3</name>
          <description>Bus fabric performance event select for PERFCTR3</description>
          <addressOffset>0x0024</addressOffset>
          <resetValue>0x0000001f</resetValue>
          <fields>
            <field>
              <name>PERFSEL3</name>
              <description>Select an event for PERFCTR3. Count either contested accesses, or all accesses, on a downstream port of the main crossbar.</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>apb_contested</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>apb</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>fastperi_contested</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>fastperi</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram5_contested</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram5</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram4_contested</name>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram4</name>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram3_contested</name>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram3</name>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram2_contested</name>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram2</name>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram1_contested</name>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram1</name>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram0_contested</name>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>sram0</name>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>xip_main_contested</name>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>xip_main</name>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>rom_contested</name>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>rom</name>
                  <value>19</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>UART0</name>
      <version>1</version>
      <baseAddress>0x40034000</baseAddress>
      <size>32</size>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>UART0_IRQ</name>
        <value>20</value>
      </interrupt>
      <registers>
        <register>
          <name>UARTDR</name>
          <description>Data Register, UARTDR</description>
          <addressOffset>0x0000</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OE</name>
              <description>Overrun error. This bit is set to 1 if data is received and the receive FIFO is already full. This is cleared to 0 once there is an empty space in the FIFO and a new character can be written to it.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BE</name>
              <description>Break error. This bit is set to 1 if a break condition was detected, indicating that the received data input was held LOW for longer than a full-word transmission time (defined as start, data, parity and stop bits). In FIFO mode, this error is associated with the character at the top of the FIFO. When a break occurs, only one 0 character is loaded into the FIFO. The next character is only enabled after the receive data input goes to a 1 (marking state), and the next valid start bit is received.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PE</name>
              <description>Parity error. When set to 1, it indicates that the parity of the received data character does not match the parity that the EPS and SPS bits in the Line Control Register, UARTLCR_H. In FIFO mode, this error is associated with the character at the top of the FIFO.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FE</name>
              <description>Framing error. When set to 1, it indicates that the received character did not have a valid stop bit (a valid stop bit is 1). In FIFO mode, this error is associated with the character at the top of the FIFO.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DATA</name>
              <description>Receive (read) data character. Transmit (write) data character.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UARTRSR</name>
          <description>Receive Status Register/Error Clear Register, UARTRSR/UARTECR</description>
          <addressOffset>0x0004</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OE</name>
              <description>Overrun error. This bit is set to 1 if data is received and the FIFO is already full. This bit is cleared to 0 by a write to UARTECR. The FIFO contents remain valid because no more data is written when the FIFO is full, only the contents of the shift register are overwritten. The CPU must now read the data, to empty the FIFO.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>BE</name>
              <description>Break error. This bit is set to 1 if a break condition was detected, indicating that the received data input was held LOW for longer than a full-word transmission time (defined as start, data, parity, and stop bits). This bit is cleared to 0 after a write to UARTECR. In FIFO mode, this error is associated with the character at the top of the FIFO. When a break occurs, only one 0 character is loaded into the FIFO. The next character is only enabled after the receive data input goes to a 1 (marking state) and the next valid start bit is received.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>PE</name>
              <description>Parity error. When set to 1, it indicates that the parity of the received data character does not match the parity that the EPS and SPS bits in the Line Control Register, UARTLCR_H. This bit is cleared to 0 by a write to UARTECR. In FIFO mode, this error is associated with the character at the top of the FIFO.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>FE</name>
              <description>Framing error. When set to 1, it indicates that the received character did not have a valid stop bit (a valid stop bit is 1). This bit is cleared to 0 by a write to UARTECR. In FIFO mode, this error is associated with the character at the top of the FIFO.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UARTFR</name>
          <description>Flag Register, UARTFR</description>
          <addressOffset>0x0018</addressOffset>
          <resetValue>0x00000090</resetValue>
          <fields>
            <field>
              <name>RI</name>
              <description>Ring indicator. This bit is the complement of the UART ring indicator, nUARTRI, modem status input. That is, the bit is 1 when nUARTRI is LOW.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TXFE</name>
              <description>Transmit FIFO empty. The meaning of this bit depends on the state of the FEN bit in the Line Control Register, UARTLCR_H. If the FIFO is disabled, this bit is set when the transmit holding register is empty. If the FIFO is enabled, the TXFE bit is set when the transmit FIFO is empty. This bit does not indicate if there is data in the transmit shift register.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RXFF</name>
              <description>Receive FIFO full. The meaning of this bit depends on the state of the FEN bit in the UARTLCR_H Register. If the FIFO is disabled, this bit is set when the receive holding register is full. If the FIFO is enabled, the RXFF bit is set when the receive FIFO is full.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TXFF</name>
              <description>Transmit FIFO full. The meaning of this bit depends on the state of the FEN bit in the UARTLCR_H Register. If the FIFO is disabled, this bit is set when the transmit holding register is full. If the FIFO is enabled, the TXFF bit is set when the transmit FIFO is full.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RXFE</name>
              <description>Receive FIFO empty. The meaning of this bit depends on the state of the FEN bit in the UARTLCR_H Register. If the FIFO is disabled, this bit is set when the receive holding register is empty. If the FIFO is enabled, the RXFE bit is set when the receive FIFO is empty.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BUSY</name>
              <description>UART busy. If this bit is set to 1, the UART is busy transmitting data. This bit remains set until the complete byte, including all the stop bits, has been sent from the shift register. This bit is set as soon as the transmit FIFO becomes non-empty, regardless of whether the UART is enabled or not.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DCD</name>
              <description>Data carrier detect. This bit is the complement of the UART data carrier detect, nUARTDCD, modem status input. That is, the bit is 1 when nUARTDCD is LOW.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DSR</name>
              <description>Data set ready. This bit is the complement of the UART data set ready, nUARTDSR, modem status input. That is, the bit is 1 when nUARTDSR is LOW.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CTS</name>
              <description>Clear to send. This bit is the complement of the UART clear to send, nUARTCTS, modem status input. That is, the bit is 1 when nUARTCTS is LOW.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UARTILPR</name>
          <description>IrDA Low-Power Counter Register, UARTILPR</description>
          <addressOffset>0x0020</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ILPDVSR</name>
              <description>8-bit low-power divisor value. These bits are cleared to 0 at reset.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UARTIBRD</name>
          <description>Integer Baud Rate Register, UARTIBRD</description>
          <addressOffset>0x0024</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BAUD_DIVINT</name>
              <description>The integer baud rate divisor. These bits are cleared to 0 on reset.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UARTFBRD</name>
          <description>Fractional Baud Rate Register, UARTFBRD</description>
          <addressOffset>0x0028</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BAUD_DIVFRAC</name>
              <description>The fractional baud rate divisor. These bits are cleared to 0 on reset.</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UARTLCR_H</name>
          <description>Line Control Register, UARTLCR_H</description>
          <addressOffset>0x002c</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SPS</name>
              <description>Stick parity select. 0 = stick parity is disabled 1 = either: * if the EPS bit is 0 then the parity bit is transmitted and checked as a 1 * if the EPS bit is 1 then the parity bit is transmitted and checked as a 0. This bit has no effect when the PEN bit disables parity checking and generation.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WLEN</name>
              <description>Word length. These bits indicate the number of data bits transmitted or received in a frame as follows: b11 = 8 bits b10 = 7 bits b01 = 6 bits b00 = 5 bits.</description>
              <bitRange>[6:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FEN</name>
              <description>Enable FIFOs: 0 = FIFOs are disabled (character mode) that is, the FIFOs become 1-byte-deep holding registers 1 = transmit and receive FIFO buffers are enabled (FIFO mode).</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>STP2</name>
              <description>Two stop bits select. If this bit is set to 1, two stop bits are transmitted at the end of the frame. The receive logic does not check for two stop bits being received.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EPS</name>
              <description>Even parity select. Controls the type of parity the UART uses during transmission and reception: 0 = odd parity. The UART generates or checks for an odd number of 1s in the data and parity bits. 1 = even parity. The UART generates or checks for an even number of 1s in the data and parity bits. This bit has no effect when the PEN bit disables parity checking and generation.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PEN</name>
              <description>Parity enable: 0 = parity is disabled and no parity bit added to the data frame 1 = parity checking and generation is enabled.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BRK</name>
              <description>Send break. If this bit is set to 1, a low-level is continually output on the UARTTXD output, after completing transmission of the current character. For the proper execution of the break command, the software must set this bit for at least two complete frames. For normal use, this bit must be cleared to 0.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
