JustAnother1/nomagic_probe/doc/RaspberryPi/rp2040-gh-1076.svd
        <register>
          <name>CH4_CSR</name>
          <description>Control and status register</description>
          <addressOffset>0x0050</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PH_ADV</name>
              <description>Advance the phase of the counter by 1 count, while it is running.\n
                Self-clearing. Write a 1, and poll until low. Counter must be running\n
                at less than full speed (div_int + div_frac / 16 &gt; 1)</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>clear</modifiedWriteValues>
            </field>
            <field>
              <name>PH_RET</name>
              <description>Retard the phase of the counter by 1 count, while it is running.\n
                Self-clearing. Write a 1, and poll until low. Counter must be running.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>clear</modifiedWriteValues>
            </field>
            <field>
              <name>DIVMODE</name>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>div</name>
                  <description>Free-running counting at rate dictated by fractional divider</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>level</name>
                  <description>Fractional divider operation is gated by the PWM B pin.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>rise</name>
                  <description>Counter advances with each rising edge of the PWM B pin.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>fall</name>
                  <description>Counter advances with each falling edge of the PWM B pin.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>B_INV</name>
              <description>Invert output B</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>A_INV</name>
              <description>Invert output A</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PH_CORRECT</name>
              <description>1: Enable phase-correct modulation. 0: Trailing-edge</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN</name>
              <description>Enable the PWM channel.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH4_DIV</name>
          <description>INT and FRAC form a fixed-point fractional number.\n
            Counting rate is system clock frequency divided by this number.\n
            Fractional division uses simple 1st-order sigma-delta.</description>
          <addressOffset>0x0054</addressOffset>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>INT</name>
              <bitRange>[11:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FRAC</name>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH4_CTR</name>
          <description>Direct access to the PWM counter</description>
          <addressOffset>0x0058</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CH4_CTR</name>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH4_CC</name>
          <description>Counter compare values</description>
          <addressOffset>0x005c</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>B</name>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>A</name>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH4_TOP</name>
          <description>Counter wrap value</description>
          <addressOffset>0x0060</addressOffset>
          <resetValue>0x0000ffff</resetValue>
          <fields>
            <field>
              <name>CH4_TOP</name>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH5_CSR</name>
          <description>Control and status register</description>
          <addressOffset>0x0064</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PH_ADV</name>
              <description>Advance the phase of the counter by 1 count, while it is running.\n
                Self-clearing. Write a 1, and poll until low. Counter must be running\n
                at less than full speed (div_int + div_frac / 16 &gt; 1)</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>clear</modifiedWriteValues>
            </field>
            <field>
              <name>PH_RET</name>
              <description>Retard the phase of the counter by 1 count, while it is running.\n
                Self-clearing. Write a 1, and poll until low. Counter must be running.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>clear</modifiedWriteValues>
            </field>
            <field>
              <name>DIVMODE</name>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>div</name>
                  <description>Free-running counting at rate dictated by fractional divider</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>level</name>
                  <description>Fractional divider operation is gated by the PWM B pin.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>rise</name>
                  <description>Counter advances with each rising edge of the PWM B pin.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>fall</name>
                  <description>Counter advances with each falling edge of the PWM B pin.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>B_INV</name>
              <description>Invert output B</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>A_INV</name>
              <description>Invert output A</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PH_CORRECT</name>
              <description>1: Enable phase-correct modulation. 0: Trailing-edge</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN</name>
              <description>Enable the PWM channel.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH5_DIV</name>
          <description>INT and FRAC form a fixed-point fractional number.\n
            Counting rate is system clock frequency divided by this number.\n
            Fractional division uses simple 1st-order sigma-delta.</description>
          <addressOffset>0x0068</addressOffset>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>INT</name>
              <bitRange>[11:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FRAC</name>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH5_CTR</name>
          <description>Direct access to the PWM counter</description>
          <addressOffset>0x006c</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CH5_CTR</name>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH5_CC</name>
          <description>Counter compare values</description>
          <addressOffset>0x0070</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>B</name>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>A</name>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH5_TOP</name>
          <description>Counter wrap value</description>
          <addressOffset>0x0074</addressOffset>
          <resetValue>0x0000ffff</resetValue>
          <fields>
            <field>
              <name>CH5_TOP</name>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH6_CSR</name>
          <description>Control and status register</description>
          <addressOffset>0x0078</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PH_ADV</name>
              <description>Advance the phase of the counter by 1 count, while it is running.\n
                Self-clearing. Write a 1, and poll until low. Counter must be running\n
                at less than full speed (div_int + div_frac / 16 &gt; 1)</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>clear</modifiedWriteValues>
            </field>
            <field>
              <name>PH_RET</name>
              <description>Retard the phase of the counter by 1 count, while it is running.\n
                Self-clearing. Write a 1, and poll until low. Counter must be running.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>clear</modifiedWriteValues>
            </field>
            <field>
              <name>DIVMODE</name>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>div</name>
                  <description>Free-running counting at rate dictated by fractional divider</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>level</name>
                  <description>Fractional divider operation is gated by the PWM B pin.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>rise</name>
                  <description>Counter advances with each rising edge of the PWM B pin.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>fall</name>
                  <description>Counter advances with each falling edge of the PWM B pin.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>B_INV</name>
              <description>Invert output B</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>A_INV</name>
              <description>Invert output A</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PH_CORRECT</name>
              <description>1: Enable phase-correct modulation. 0: Trailing-edge</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN</name>
              <description>Enable the PWM channel.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH6_DIV</name>
          <description>INT and FRAC form a fixed-point fractional number.\n
            Counting rate is system clock frequency divided by this number.\n
            Fractional division uses simple 1st-order sigma-delta.</description>
          <addressOffset>0x007c</addressOffset>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>INT</name>
              <bitRange>[11:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FRAC</name>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH6_CTR</name>
          <description>Direct access to the PWM counter</description>
          <addressOffset>0x0080</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CH6_CTR</name>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH6_CC</name>
          <description>Counter compare values</description>
          <addressOffset>0x0084</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>B</name>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>A</name>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH6_TOP</name>
          <description>Counter wrap value</description>
          <addressOffset>0x0088</addressOffset>
          <resetValue>0x0000ffff</resetValue>
          <fields>
            <field>
              <name>CH6_TOP</name>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH7_CSR</name>
          <description>Control and status register</description>
          <addressOffset>0x008c</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PH_ADV</name>
              <description>Advance the phase of the counter by 1 count, while it is running.\n
                Self-clearing. Write a 1, and poll until low. Counter must be running\n
                at less than full speed (div_int + div_frac / 16 &gt; 1)</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>clear</modifiedWriteValues>
            </field>
            <field>
              <name>PH_RET</name>
              <description>Retard the phase of the counter by 1 count, while it is running.\n
                Self-clearing. Write a 1, and poll until low. Counter must be running.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>clear</modifiedWriteValues>
            </field>
            <field>
              <name>DIVMODE</name>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>div</name>
                  <description>Free-running counting at rate dictated by fractional divider</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>level</name>
                  <description>Fractional divider operation is gated by the PWM B pin.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>rise</name>
                  <description>Counter advances with each rising edge of the PWM B pin.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>fall</name>
                  <description>Counter advances with each falling edge of the PWM B pin.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>B_INV</name>
              <description>Invert output B</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>A_INV</name>
              <description>Invert output A</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PH_CORRECT</name>
              <description>1: Enable phase-correct modulation. 0: Trailing-edge</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EN</name>
              <description>Enable the PWM channel.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH7_DIV</name>
          <description>INT and FRAC form a fixed-point fractional number.\n
            Counting rate is system clock frequency divided by this number.\n
            Fractional division uses simple 1st-order sigma-delta.</description>
          <addressOffset>0x0090</addressOffset>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>INT</name>
              <bitRange>[11:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FRAC</name>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH7_CTR</name>
          <description>Direct access to the PWM counter</description>
          <addressOffset>0x0094</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CH7_CTR</name>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH7_CC</name>
          <description>Counter compare values</description>
          <addressOffset>0x0098</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>B</name>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>A</name>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CH7_TOP</name>
          <description>Counter wrap value</description>
          <addressOffset>0x009c</addressOffset>
          <resetValue>0x0000ffff</resetValue>
          <fields>
            <field>
              <name>CH7_TOP</name>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EN</name>
          <description>This register aliases the CSR_EN bits for all channels.\n
            Writing to this register allows multiple channels to be enabled\n
            or disabled simultaneously, so they can run in perfect sync.\n
            For each channel, there is only one physical EN register bit,\n
            which can be accessed through here or CHx_CSR.</description>
          <addressOffset>0x00a0</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CH7</name>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH6</name>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH5</name>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH4</name>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH3</name>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH2</name>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH1</name>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CH0</name>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
