JustAnother1/nomagic_probe/doc/RaspberryPi/rp2040-gh-1076.svd
        <register>
          <name>ADDR_ENDP14</name>
          <description>Interrupt endpoint 14. Only valid for HOST mode.</description>
          <addressOffset>0x0038</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTEP_PREAMBLE</name>
              <description>Interrupt EP requires preamble (is a low speed device on a full speed hub)</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INTEP_DIR</name>
              <description>Direction of the interrupt endpoint. In=0, Out=1</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ENDPOINT</name>
              <description>Endpoint number of the interrupt endpoint</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDRESS</name>
              <description>Device address</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDR_ENDP15</name>
          <description>Interrupt endpoint 15. Only valid for HOST mode.</description>
          <addressOffset>0x003c</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INTEP_PREAMBLE</name>
              <description>Interrupt EP requires preamble (is a low speed device on a full speed hub)</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INTEP_DIR</name>
              <description>Direction of the interrupt endpoint. In=0, Out=1</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ENDPOINT</name>
              <description>Endpoint number of the interrupt endpoint</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDRESS</name>
              <description>Device address</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MAIN_CTRL</name>
          <description>Main control register</description>
          <addressOffset>0x0040</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SIM_TIMING</name>
              <description>Reduced timings for simulation</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HOST_NDEVICE</name>
              <description>Device mode = 0, Host mode = 1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CONTROLLER_EN</name>
              <description>Enable controller</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SOF_WR</name>
          <description>Set the SOF (Start of Frame) frame number in the host controller. The SOF packet is sent every 1ms and the host will increment the frame number by 1 each time.</description>
          <addressOffset>0x0044</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>COUNT</name>
              <bitRange>[10:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SOF_RD</name>
          <description>Read the last SOF (Start of Frame) frame number seen. In device mode the last SOF received from the host. In host mode the last SOF sent by the host.</description>
          <addressOffset>0x0048</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>COUNT</name>
              <bitRange>[10:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SIE_CTRL</name>
          <description>SIE control register</description>
          <addressOffset>0x004c</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EP0_INT_STALL</name>
              <description>Device: Set bit in EP_STATUS_STALL_NAK when EP0 sends a STALL</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EP0_DOUBLE_BUF</name>
              <description>Device: EP0 single buffered = 0, double buffered = 1</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EP0_INT_1BUF</name>
              <description>Device: Set bit in BUFF_STATUS for every buffer completed on EP0</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EP0_INT_2BUF</name>
              <description>Device: Set bit in BUFF_STATUS for every 2 buffers completed on EP0</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EP0_INT_NAK</name>
              <description>Device: Set bit in EP_STATUS_STALL_NAK when EP0 sends a NAK</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DIRECT_EN</name>
              <description>Direct bus drive enable</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DIRECT_DP</name>
              <description>Direct control of DP</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DIRECT_DM</name>
              <description>Direct control of DM</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TRANSCEIVER_PD</name>
              <description>Power down bus transceiver</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RPU_OPT</name>
              <description>Device: Pull-up strength (0=1K2, 1=2k3)</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PULLUP_EN</name>
              <description>Device: Enable pull up resistor</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PULLDOWN_EN</name>
              <description>Host: Enable pull down resistors</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RESET_BUS</name>
              <description>Host: Reset bus</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>clear</modifiedWriteValues>
            </field>
            <field>
              <name>RESUME</name>
              <description>Device: Remote wakeup. Device can initiate its own resume after suspend.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>clear</modifiedWriteValues>
            </field>
            <field>
              <name>VBUS_EN</name>
              <description>Host: Enable VBUS</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>KEEP_ALIVE_EN</name>
              <description>Host: Enable keep alive packet (for low speed bus)</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SOF_EN</name>
              <description>Host: Enable SOF generation (for full speed bus)</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SOF_SYNC</name>
              <description>Host: Delay packet(s) until after SOF</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PREAMBLE_EN</name>
              <description>Host: Preable enable for LS device on FS hub</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>STOP_TRANS</name>
              <description>Host: Stop transaction</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>clear</modifiedWriteValues>
            </field>
            <field>
              <name>RECEIVE_DATA</name>
              <description>Host: Receive transaction (IN to host)</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SEND_DATA</name>
              <description>Host: Send transaction (OUT from host)</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SEND_SETUP</name>
              <description>Host: Send Setup packet</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>START_TRANS</name>
              <description>Host: Start transaction</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>clear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SIE_STATUS</name>
          <description>SIE status register</description>
          <addressOffset>0x0050</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DATA_SEQ_ERROR</name>
              <description>Data Sequence Error.\n\n
                The device can raise a sequence error in the following conditions:\n\n
                * A SETUP packet is received followed by a DATA1 packet (data phase should always be DATA0) * An OUT packet is received from the host but doesn't match the data pid in the buffer control register read from DPSRAM\n\n
                The host can raise a data sequence error in the following conditions:\n\n
                * An IN packet from the device has the wrong data PID</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>ACK_REC</name>
              <description>ACK received. Raised by both host and device.</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>STALL_REC</name>
              <description>Host: STALL received</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>NAK_REC</name>
              <description>Host: NAK received</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>RX_TIMEOUT</name>
              <description>RX timeout is raised by both the host and device if an ACK is not received in the maximum time specified by the USB spec.</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>RX_OVERFLOW</name>
              <description>RX overflow is raised by the Serial RX engine if the incoming data is too fast.</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>BIT_STUFF_ERROR</name>
              <description>Bit Stuff Error. Raised by the Serial RX engine.</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>CRC_ERROR</name>
              <description>CRC Error. Raised by the Serial RX engine.</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>BUS_RESET</name>
              <description>Device: bus reset received</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>TRANS_COMPLETE</name>
              <description>Transaction complete.\n\n
                Raised by device if:\n\n
                * An IN or OUT packet is sent with the `LAST_BUFF` bit set in the buffer control register\n\n
                Raised by host if:\n\n
                * A setup packet is sent when no data in or data out transaction follows * An IN packet is received and the `LAST_BUFF` bit is set in the buffer control register * An IN packet is received with zero length * An OUT packet is sent and the `LAST_BUFF` bit is set</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>SETUP_REC</name>
              <description>Device: Setup packet received</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>CONNECTED</name>
              <description>Device: connected</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>RESUME</name>
              <description>Host: Device has initiated a remote resume. Device: host has initiated a resume.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>VBUS_OVER_CURR</name>
              <description>VBUS over current detected</description>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SPEED</name>
              <description>Host: device speed. Disconnected = 00, LS = 01, FS = 10</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>SUSPENDED</name>
              <description>Bus in suspended state. Valid for device and host. Host and device will go into suspend if neither Keep Alive / SOF frames are enabled.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>LINE_STATE</name>
              <description>USB bus line state</description>
              <bitRange>[3:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>VBUS_DETECTED</name>
              <description>Device: VBUS Detected</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_EP_CTRL</name>
          <description>interrupt endpoint control register</description>
          <addressOffset>0x0054</addressOffset>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>INT_EP_ACTIVE</name>
              <description>Host: Enable interrupt endpoint 1 -&gt; 15</description>
              <bitRange>[15:1]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
